# 인하대학교 후문 뒤쪽에는 어두운 굴다리가 있다. 겁쟁이 상빈이는 길이 조금이라도 어둡다면 가지 않는다. 따라서 굴다리로 가면 최단거리로 집까지 갈수 있지만, 
# 굴다리는 어둡기 때문에 빙빙 돌아서 집으로 간다. 안타깝게 여긴 인식이는 굴다리 모든 길 0~N을 밝히게 가로등을 설치해 달라고 인천광역시에 민원을 넣었다. 인천광역시에서 가로등을 설치할 개수 M과 각 가로등의 위치 x들의 결정을 끝냈다. 
# 그리고 각 가로등은 높이만큼 주위를 비출 수 있다. 
# 하지만 갑자기 예산이 부족해진 인천광역시는 가로등의 높이가 높을수록 가격이 비싸지기 때문에 최소한의 높이로 굴다리 모든 길 0~N을 밝히고자 한다. 최소한의 예산이 들 높이를 구하자. 단 가로등은 모두 높이가 같아야 하고, 정수이다.
# 가로등의 높이가 H라면 왼쪽으로 H, 오른쪽으로 H만큼 주위를 비춘다.
# 다음 그림은 예제1에 대한 설명이다.
# 가로등의 높이가 1일 경우 0~1사이의 길이 어둡기 때문에 상빈이는 지나가지 못한다.
# 아래 그림처럼 높이가 2일 경우 0~5의 모든 길이 밝기 때문에 상빈이는 지나갈 수 있다.

import sys

input = sys.stdin.readline

n = int(input())
m = int(input())
arr = list(map(int, input().split()))

if len(arr) == 1:
    height = max(arr[0], n - arr[0])
else:
    height = arr[0]
    for i in range(len(arr)):
        if i == (len(arr) - 1):
            tmp = n - arr[-1]
        else:        
            a = arr[i+1] - arr[i]
            if a % 2: 
                tmp = a // 2 + 1
            else:
                tmp = a // 2
        height = max(height, tmp)
print(height)